Revit 2024 API
Location Members
The Location type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Move
Move the element within the project by a specified vector.
Rotate
Rotate the element within the project by a specified angle around a given axis.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
Location Class
Autodesk.Revit.DB Namespace